### 欢迎您使用Reqable！

Reqable许可协议（以下简称“本协议”）由Reqable软件开发商 **上海日夸宝信息技术有限公司**（以下简称“我们”）与您签订。我们将通过本协议帮助您了解本应用许可使用及相关方面的权利义务。请您务必审慎阅读并充分理解本协议各项条款内容，并选择同意或不同意（如您是未成年人，则应在法定监护人陪同下审查阅读）。如果您不同意本协议的全部条款，请退出并卸载本应用。请认真阅读以下本协议的内容：


### 关于Reqable

Reqable（以下简称“本应用”）是我们开发的一款多平台的API开发和测试工具，用于软件开发和测试人员（但不限于）进行网络API接口开发、分析调试、应用测试和Bug分析。本应用某些场景下可能具有修改和调试网络数据包的功能，这些功能均是用于提高API接口生产和测试效率。如果您需要修改和调试第三方的数据包，必须取得所属方的官方授权；如果在未授权的情况下擅自修改和调试，所造成的任何问题和责任（包括资金损失、法律风险等）均与我们无关。


### 隐私权限

我们会遵循正当、合法、必要的原则，收集和使用您在使用Reqable产品或服务而产生的个人信息，这些信息仅用于改善软件质量，不会向任何人或者机构透露或分享，如果您不希望报告这些数据，可以在应用设置中进行关闭。Reqable收集的信息仅包括以下部分：

- 系统信息，包括型号、版本、内存、CPU指令集类型。
- 软件Crash产生的日志。
- 软件功能交互，包括点击事件，功能使用时长。

我们绝不会收集、上传和存储用户的身份信息、包括Cookie、账号、密钥、网络数据包内容、数据接口、个人隐私、历史记录以及其它应用信息等。

### 会员服务

Reqable致力于做干净优秀的API开发工具，始终坚持无广告、无后台的绿色行为，承诺不会恶意使某些功能对非付费用户运行不正常，我们将为所有用户提供愉悦的使用体验。

与此同时，我们深知，一个软件能够长久持续地运营下去，也需要有健康的发展模式，如果您有意支持我们，可以开通高级会员功能，享受更丰富的功能，非常感谢您的支持！

从3.0版本开始，我们将提供三种级别的付费会员服务，月度会员（30天）、年度会员和永久会员，除了有效时间不同之外，软件功能上都是一致的。3.0版本之前版本购买的许可证，可以迁移到当前的付费会员服务，无需再次付费，会员权益也不会有任何损失。

在购买付费会员服务之前，请您认真阅读以下的注意事项：
- 付费会员相关的权益说明，请查看[《会员权益》](https://reqable.com/pricing)。
- 购买后7天内可以无理由退款（Apple App Store渠道以平台为准），在退款周期内您可以向 [payment@reqable.com](mailto:payment@reqable.com) 邮件提交退款申请，我们会在5个工作日内给您安排退款。
- 同一个邮箱账号，只需要购买一次，购买后可在全部平台设备上使用，但是最多同时登录6台设备，超限后最先登录设备将会自动退出登录。
- 在非退款周期内，如果从非永久会员升级到永久会员，我们不会退还之前支付的费用。
- 在非退款周期内，如果删除了Reqable账号，我们不会退还之前支付的费用。
- 购买会员后，您可以向我们客服（官网右下角添加企业微信客服）申请开发票。

### 功能风险

- 本应用运行过程中产生的数据缓存，可能会包含您的敏感信息（包括密码、Cookie等），请务必及时进行清理，或者在进行敏感数据操作时关闭本应用；
- 如果您所在的地区法律禁止本应用相关类型的软件程序，您应当遵守当地法律，立即卸载本应用。


### 禁止行为

无论在任何情况下，您都不得作出本应用禁止的行为：
- 禁止使用本应用对任何网络数据进行恶意攻击、制作外挂、盗取数据等非法行为；
- 禁止在未取得其它域名、IP和应用的官方授权的情况下，对其网络数据进行调试和修改；
- 禁止对本应用本身进行逆向工程（包括但不限于反编译、修改安装包、修改签名信息等），或者以其它方式尝试修改本应用的功能；
- 禁止在未经过我们授权情况下向任何渠道发布本应用的任何版本。


### 免责事由

您知悉并同意，我们不因下述任一情况而可能导致的任何损害赔偿承担责任，包括但不限于财产、收益、数据资料等方面的损失或其它形式的无形损失：
- 您违反本协议或者相关的服务条款规定，我们有权视您的行为性质采取包括但不限于中断使用许可、停止提供服务、限制使用、法律追究等措施。同时，我们会视司法部门的要求，协助调查；
- 您违反本协议或者相关的服务条款规定，导致任何第三方损害的，您应当独立承担责任；
- 因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素导致本应用服务不能正常使用；
- 由于黑客攻击、电信部门技术调整或故障、系统维护等因素导致系统服务中断或延迟；
- 由于政府命令、法律法规的变更、司法机关及行政机关的命令、裁定等原因而导致的系统服务中断、终止或延迟。


### 其它条款

您知悉并同意以下条款：
- 电子文本形式的授权协议如同双方签署的协议一样，具有完整和等同的法律效力。您使用本应用或本服务及视为您已阅读并同意受本协议的约束，协议许可范围以外的行为，将直接违反本协议并构成侵权，我们有权立即终止服务，责令损止停害，并保留追究相关责任的权利；
- 我们有权在必要时修改本协议条款。您可以在本应用的最新版本中查阅相关条款协议。本协议条款变更后，如果您继续使用本应用，即视为您已同意修改后的协议。如果您不同意修改后的协议，应当立即停止使用本应用；
- 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力；
- 本协议所有的条款标题仅为阅读方便，本身并无实际含义，不能作为本协议涵义解释的依据；
- 我们保留对于本协议的最终解释权。

*以上条款更新于 2025-10-28*

### 如果您同意以上协议的全部条款，请点击下方“同意”按钮。
